posts/Virtualization/qemu adding a new trace point.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QEMU: Adding a New Trace Event</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">QEMU: Adding a New Trace Event</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4711058">1. Locate corresponding trace events file</a></li>
<li><a href="#orgedcffa3">2. Specify trace events</a></li>
<li><a href="#orgb2c741c">3. Place your trace function</a></li>
<li><a href="#org96192a4">4. Build and run</a></li>
<li><a href="#org500b83f">5. Troubleshooting</a>
<ul>
<li><a href="#orga479ab9">5.1. "<code>implicit declaration of function 'trace_xxx'</code> "?</a></li>
<li><a href="#org90d7181">5.2. "<code>trace-events does not end with a new line</code>"?</a></li>
<li><a href="#org6d89fd7">5.3. "warning: trace event 'abc' does not exist"?</a></li>
</ul>
</li>
<li><a href="#org67d2034">6. See also</a></li>
</ul>
</div>
</div>
<p>
For example, I want to add three trace functions in
<code>migration/migration.c</code>:
</p>
<pre class="example">
trace_migration_completion_wakeup_request();
trace_migration_completion_globalstate_store();
trace_migration_completion_vm_stop();
</pre>

<p>
The steps are as follows.
</p>

<div id="outline-container-org4711058" class="outline-2">
<h2 id="org4711058"><span class="section-number-2">1</span> Locate corresponding trace events file</h2>
<div class="outline-text-2" id="text-1">
<p>
First, find the <code>trace-events</code> file in the sub-directory where your
modification is going to happen.  Here, it is
<code>migration/trace-events</code>.
</p>
</div>
</div>
<div id="outline-container-orgedcffa3" class="outline-2">
<h2 id="orgedcffa3"><span class="section-number-2">2</span> Specify trace events</h2>
<div class="outline-text-2" id="text-2">
<p>
Then, append one line for each trace function.  The line specifies the
trace function name, its args and print formatting.  In my case, they
are
</p>
<pre class="example">
migration_completion_wakeup_request(void) ""
migration_completion_globalstate_store(void) ""
migration_completion_vm_stop(void) ""
</pre>
</div>
</div>
<div id="outline-container-orgb2c741c" class="outline-2">
<h2 id="orgb2c741c"><span class="section-number-2">3</span> Place your trace function</h2>
<div class="outline-text-2" id="text-3">
<p>
Now place the trace functions where you want.
</p>
</div>
</div>
<div id="outline-container-org96192a4" class="outline-2">
<h2 id="org96192a4"><span class="section-number-2">4</span> Build and run</h2>
<div class="outline-text-2" id="text-4">
<p>
Note that tracing should be enabled with a backend and switched on.
When <code>./configure</code>, add
</p>
<pre class="example">
--enable-trace-backends=&lt;choose your tracing backends&gt;
</pre>
<p>
Check <code>/.configure --help</code> for supported tracing backends.
</p>

<p>
And when run QEMU, add
</p>
<pre class="example">
-trace events=&lt;file that contains events you want to trace&gt;
</pre>
</div>
</div>
<div id="outline-container-org500b83f" class="outline-2">
<h2 id="org500b83f"><span class="section-number-2">5</span> Troubleshooting</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orga479ab9" class="outline-3">
<h3 id="orga479ab9"><span class="section-number-3">5.1</span> "<code>implicit declaration of function 'trace_xxx'</code> "?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
This is possibly due to not including "<code>trace.h</code>".  QEMU generates the
implementation of the trace functions for you according to the
<code>trace-events</code> files in <code>trace.c</code> files, as well as the declarations
in <code>trace.h</code> files.  Many "<code>.c</code>" files have already included
"trace.h".  If not, include it yourself.
</p>
</div>
</div>
<div id="outline-container-org90d7181" class="outline-3">
<h3 id="org90d7181"><span class="section-number-3">5.2</span> "<code>trace-events does not end with a new line</code>"?</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Currently all the <code>trace-events</code> files should be ended with a new
line.  Otherwise error would be reported when parsing and when at run
time.
</p>
</div>
</div>
<div id="outline-container-org6d89fd7" class="outline-3">
<h3 id="org6d89fd7"><span class="section-number-3">5.3</span> "warning: trace event 'abc' does not exist"?</h3>
<div class="outline-text-3" id="text-5-3">
<p>
If you get this error while the trace event is actually named 'abcd',
it is likely the same reason as the issue above.  An ending new line
is required in the <code>trace-events</code> files.
</p>
</div>
</div>
</div>
<div id="outline-container-org67d2034" class="outline-2">
<h2 id="org67d2034"><span class="section-number-2">6</span> See also</h2>
<div class="outline-text-2" id="text-6">
<p>
For more details on QEMU tracing, see <code>docs/devel/tracing.txt</code> in the
QEMU repository.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Jul 09, 2019</p>
<p class="validation"></p>
</div>
</body>
</html>
